# Exercícios - Introdução a Pandas

O objetivo desse notebook é ajudar na fixação dos conteúdos da aula de [Introdução a Pandas]().  

Caso haja alguma dúvida, consulte o material e as referências bibliográficas, mas também estamos à disposição por e-mail, slack ou telegram! Não hesite em falar conosco =D

## Estruturas

### Serie

In [1]:
# primeira coisa que se deve fazer para utilizar uma biblioteca....
import pandas as pd

In [2]:
# declare um dicionário com nomes de alunos e suas notas
report = {'john': 10, 'jane': 8, 'bob': 9, 'patrick': 3, 'blu': 5}

In [3]:
# imprima o dicionario
report

{'john': 10, 'jane': 8, 'bob': 9, 'patrick': 3, 'blu': 5}

In [5]:
# crie uma Serie utilizando esse dicionario
reportseries = pd.Series(report)

In [6]:
# imprima a serie
reportseries

john       10
jane        8
bob         9
patrick     3
blu         5
dtype: int64

In [7]:
# veja os indices da Serie
reportseries.index

Index(['john', 'jane', 'bob', 'patrick', 'blu'], dtype='object')

In [8]:
# veja a primeira nota
reportseries[0]

10

In [9]:
# veja a maior nota
reportseries.max()

10

In [10]:
# veja o aluno que tem a maior nota]
# (Dica: esse vai exigir uma pesquisa)
reportseries.argmax()

0

## Dataframe

In [21]:
# crie um Dataframe com os mesmos alunos. Ele deve ter como features o nome do aluno, 
# a nota da prova, a nota do trabalho e a nota do seminário 
rep = { 'Nome': ['John', 'Jane', 'Bob', 'Patrick', 'Blu'],
        'Prova': [10, 8, 9, 3, 5],
        'Trab': [9, 6, 7, 2, 1],
        'Seminario': [0, 4, 5, 2, 4]}

df = pd.DataFrame(rep)
df

      Nome  Prova  Trab  Seminario
0     John     10     9          0
1     Jane      8     6          4
2      Bob      9     7          5
3  Patrick      3     2          2
4      Blu      5     1          4

In [13]:
# salve esse dataframe como um arquivo no formato CSV, tendo ';' como separador
df.to_csv('report.csv', sep=';')

## Leitura de Dados

In [22]:
# leia o arquivo que você acabou de salvar com as informações dos alunos
df = pd.read_csv('report.csv', sep=';', index_col=0)
df

      Nome  Prova  Trab  Seminario
0     John     10     9          0
1     Jane      8     6          4
2      Bob      9     7          5
3  Patrick      3     2          2
4      Blu      5     1          4

## Visualização do Dataframe

In [23]:
# veja se os nomes das colunas para garantir que estão corretas
df.columns

Index(['Nome', 'Prova', 'Trab', 'Seminario'], dtype='object')

In [24]:
# veja se o dataframe tem o mesmo tamanho que tinha quando você o salvou
df.shape

(5, 4)

In [25]:
# veja os tipos das colunas e se fazem sentido
df.dtypes

Nome         object
Prova         int64
Trab          int64
Seminario     int64
dtype: object

In [26]:
# imprima os 3 primeiros exemplos usando a função head
df.head(3)

   Nome  Prova  Trab  Seminario
0  John     10     9          0
1  Jane      8     6          4
2   Bob      9     7          5

In [27]:
# imprima os 4 últimos exemplos usando a função tail
df.tail(4)

      Nome  Prova  Trab  Seminario
1     Jane      8     6          4
2      Bob      9     7          5
3  Patrick      3     2          2
4      Blu      5     1          4

## Seleção dos dados

In [28]:
# imprima as notas das provas
df['Prova']

0    10
1     8
2     9
3     3
4     5
Name: Prova, dtype: int64

In [30]:
# imprima as informações do primeiro aluno da tabela
df.iloc[0,:]

Nome         John
Prova          10
Trab            9
Seminario       0
Name: 0, dtype: object

In [32]:
# imprima as informações do aluno cuja label é 1 (index?)
df.loc[1]

Nome         Jane
Prova           8
Trab            6
Seminario       4
Name: 1, dtype: object

In [33]:
# altere a nota da prova do primeiro aluno para 5
df['Prova'].iat[0] = 5
df

      Nome  Prova  Trab  Seminario
0     John      5     9          0
1     Jane      8     6          4
2      Bob      9     7          5
3  Patrick      3     2          2
4      Blu      5     1          4

In [35]:
# altere a nota do seminario do aluno cuja label é 1 para 10
df['Seminario'].at[1] = 10
df

      Nome  Prova  Trab  Seminario
0     John      5     9          0
1     Jane      8     6         10
2      Bob      9     7          5
3  Patrick      3     2          2
4      Blu      5     1          4

## Indexação booleana

In [40]:
# cheque quais alunos tem nota de prova maior que 5
df[df['Prova'] > 5]

   Nome  Prova  Trab  Seminario
1  Jane      8     6         10
2   Bob      9     7          5

In [41]:
# cheque quais alunos foram aprovados (nota da prova >= 5 e média entre trabalho e seminário >= 5)
df[(df['Prova'] > 5) & ((df['Trab'] + df['Seminario']) / 2 >= 5.0)]

   Nome  Prova  Trab  Seminario
1  Jane      8     6         10
2   Bob      9     7          5

In [46]:
# conte quantos alunos reprovaram em pelo menos uma das avaliações (n)

## Operações

In [28]:
# veja a média da turma em cada avaliação

In [29]:
# veja a maior e a menor nota

In [30]:
# crie uma nota feature no dataframe com a média do aluno

## Apply

In [31]:
# crie uma feature nova contendo a maior nota que o aluno tirou dentre todas as avaliações

## Funções Úteis

In [32]:
# quantos alunos tiraram cada nota na prova?

In [35]:
# selecione as duas notas de trabalho mais frequentes
# (O que acontece se tivermos um empate triplo?)

In [36]:
# veja o resumo estatístico da turma

## Dados faltantes

In [37]:
# insira um novo aluno na tabela, o qual não tem nenhuma nota

In [ ]:
# para o aluno que não tem nenhuma nota, atribua a ele a média da turma

## Plot

In [39]:
# veja a distribuição das notas

In [40]:
# cheque a relação entre as notas da prova e do trabalho

In [ ]:
# cheque a relação entre as notas duas a duas